Процедура ТестДолжен_ПроверитьВычислениеПростогоВыражения() Экспорт

	Сообщить(Вычислить("2 + 2"));
	
	ВнешняяПеременная = 1;
	// ПроверитьРавенство(1, Вычислить("ВнешняяПеременная"));
	Сообщить(Вычислить("ВнешняяПеременная"));

КонецПроцедуры

Функция ХорошийМетод()
	Возврат Сред("ААА",2,1);
КонецФункции

Процедура ТестДолжен_ПроверитьВычислениеВызоваФункции() Экспорт
	Текст = "";
	Для Сч = 1 По 3 Цикл
		Текст = Текст + Вычислить("ХорошийМетод()");
	КонецЦикла;
	
	// ПроверитьРавенство("ААА", Текст);
	Сообщить(Текст);
КонецПроцедуры

Процедура ТестДолжен_ПроверитьВычислениеБроскаИсключения() Экспорт
	
	Перем ОК;
	
	Попытка
		А = Вычислить("НехорошийМетод()");
	Исключение
		ТекстОшибки = ИнформацияОбОшибке().Описание;
		Сообщить("Получено исключение: " + ТекстОшибки);
		ОК = Истина;
	КонецПопытки;
	
	// ПроверитьРавенство(True, ОК);
	Сообщить(ОК);
		
КонецПроцедуры

Процедура ТестДолжен_ПроверитьОператорВыполнить() Экспорт
	
	ВнешнийКонтекст = "Привет";
	
	Выполнить("ВнешнийКонтекст = ""Пока""");
	
	// ПроверитьРавенство("Пока", ВнешнийКонтекст);
	Сообщить(ВнешнийКонтекст);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьОбращениеКЛокальнымПеременным() Экспорт

	Массив = Новый Массив();
	Массив.Добавить(1);
	Массив.Добавить(2);
	Массив.Добавить(3);

	Результат = 0;
	
	КодДляВыполнения = "
	|Для Каждого ОчередноеНечто Из Массив Цикл
	|	Результат = Результат + ОчередноеНечто;
	|КонецЦикла;";

	Выполнить(КодДляВыполнения);
	
	// ПроверитьРавенство(6, Результат);
	Сообщить(Результат);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьОператорВыполнитьСВыбросомИсключения() Экспорт
	
	ВнешнийКонтекст = "Привет";
	
	Попытка
		Выполнить("ВнешнийКонтекст = ""Пока"";
		|ВызватьИсключение 123;");
	Исключение
		Сообщить(ВнешнийКонтекст);
		Сообщить(ИнформацияОбОшибке().Описание);
		Возврат;
	КонецПопытки;
	
	ВызватьИсключение "Должно было быть выдано исключение, но его не было";
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьЧтоВОператореВыполнитьЗапрещенВозврат() Экспорт
	
	ТекстМетода = "А = 1;
	|Возврат А;";
	
	Попытка
		Выполнить(ТекстМетода);
	Исключение
		
		Эталон = НСтр("ru='Оператор ""Возврат"" может использоваться только внутри метода';en='Return operator may not be used outside procedure or function'");
		// ПроверитьИстину(Найти(ИнформацияОбОшибке().Описание, Эталон)>0);
		// ПроверитьРавенство("Оператор \"Возврат\" может использоваться только внутри метода", Эталон);
		Сообщить(Эталон);
		Сообщить(ИнформацияОбОшибке().Описание);
		Возврат;
	КонецПопытки;
	
	ВызватьИсключение "Должно было быть выдано исключение, но его не было";
	
КонецПроцедуры

Функция ТестМетод1(П1)
    
    ЛокальнаяПеременная = 1;
    
    Возврат Вычислить("ЛокальнаяПеременная + П1 + 1");
    
КонецФункции

Функция ТестМетод2(П2, П1)
    ДругаяПеременная = 3;
    ЛокальнаяПеременная = 1;
        
    Возврат Вычислить("ЛокальнаяПеременная + П1 + 1");
КонецФункции

Процедура ТестДолжен_ПроверитьКешКомпиляцииВРазныхФреймах() Экспорт
    
    Рез1 = ТестМетод1(1);
    Рез2 = ТестМетод1(1);
    Рез3 = ТестМетод2(Неопределено, 1);
    Рез4 = ТестМетод2(Неопределено, 1);
    
    // ПроверитьРавенство(3, Рез1);
	Сообщить(Рез1);
    // ПроверитьРавенство(3, Рез2);
	Сообщить(Рез2);
    // ПроверитьРавенство(3, Рез3);
	Сообщить(Рез3);
    // ПроверитьРавенство(3, Рез4);
	Сообщить(Рез4);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьРекурсивныйВызовВычислить() Экспорт
	Рез = "Вычислить(1)";
	Для й=1 По 100 Цикл
	  Рез = "Вычислить("+Рез+")+1";
	КонецЦикла;
	
	Рез = Вычислить(Рез);
    // ПроверитьРавенство(101, Рез);
	Сообщить(Рез);
КонецПроцедуры

Функция Один()
	Возврат Вычислить("1");
КонецФункции

Функция Два()
  Один = Вычислить("Один()"); 
  Возврат Вычислить("Один+Один()");
КонецФункции

Функция Шесть() 
	Три = 3;
	Возврат Вычислить("Два()") * Три;
КонецФункции

Функция СорокДва(Семь)
	Возврат Вычислить("Семь * Шесть()");
КонецФункции 

Функция Ответ()
	Возврат Вычислить("Глобал + СорокДва(7)");
КонецФункции 

Процедура ТестДолжен_ПроверитьСложныеВложенныеВызовыВычислить() Экспорт
	Глобал = 0;
	Рез = Вычислить("Ответ()");	
    //ПроверитьРавенство(42, Рез);
	Сообщить(Рез);
	
	Глобал = 66;
	Рез = Вычислить("Ответ()");	
    //ПроверитьРавенство(108, Рез);
	Сообщить(Рез);
КонецПроцедуры

Процедура ТестДолжен_ПроверитьВычислитьВнутриВыполнить() Экспорт
	Рез = -1;
	Выполнить("Для й=1 По 9 Цикл ц = -й; КонецЦикла; Рез = Вычислить(""ц + й"")");
    //ПроверитьРавенство(1, Рез);
	Сообщить(Рез);
КонецПроцедуры

ТестДолжен_ПроверитьВычислениеПростогоВыражения();
ТестДолжен_ПроверитьВычислениеВызоваФункции();
ТестДолжен_ПроверитьВычислениеБроскаИсключения();
ТестДолжен_ПроверитьОператорВыполнить();
ТестДолжен_ПроверитьОбращениеКЛокальнымПеременным();
ТестДолжен_ПроверитьОператорВыполнитьСВыбросомИсключения();
ТестДолжен_ПроверитьЧтоВОператореВыполнитьЗапрещенВозврат();
// ТестДолжен_ПроверитьСвойствоЭтотОбъект_issue712();
// ТестДолжен_ПроверитьEvalНаРазныхЭкземплярахThis();
ТестДолжен_ПроверитьКешКомпиляцииВРазныхФреймах();
ТестДолжен_ПроверитьРекурсивныйВызовВычислить();
ТестДолжен_ПроверитьСложныеВложенныеВызовыВычислить();
ТестДолжен_ПроверитьВычислитьВнутриВыполнить();
// ТестДолжен_ПроверитьАлиасыФункцийИПеременныхВВычислить();
// ТестДолжен_ПроверитьОбработкуИсключенияВВыполнить();
// ТестДолжен_ПроверитьРекурсивныйВызовВыполнить();
// ТестДолжен_ПроверитьВложенныеВызовыВыполнить();	
// ТестДолжен_ПроверитьВызовыВыполнитьСПопытками();
// ТестДолжен_ПроверитьРаботоспособностьВПодключенныхСценариях();
// ТестДолжен_ПроверитьРаботоспособностьСПараметрамиПроцедуры();