

НомерТеста = 0;
ТестДолжен_СоздатьФиксированноеСоответствиеПоСоответствию();
ТестДолжен_СоздатьСоответствиеПоФиксированномуСоответствию();
ТестДолжен_ПроверитьНеизменностьфиксированногоСоответствия(); 
ТестДолжен_ПроверитьЧтоНельзяПоменятьЗначениеПриОбращенииЧерезКлюч();
ТестДолжен_ПроверитьОтсутствиеМетодаВставить();
ТестДолжен_ПроверитьЧтоНесуществующийКлючНельзяПрочитать();
ТестДолжен_ПроверитьЧтоСуществующийКлючНельзяИзменить();
ТестДолжен_ПроверитьЧтоПолучениеНесуществующегоКлючаНеВызываетОшибки();

&НаКлиенте
Процедура ТестДолжен_СоздатьФиксированноеСоответствиеПоСоответствию() Экспорт

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Ключ1", "Значение1");
	
	ФиксированноеСоответствие = Новый ФиксированноеСоответствие(Соответствие);
	
	ПроверитьРавенство(ТипЗнч(ФиксированноеСоответствие), Тип("ФиксированноеСоответствие"));
	ПроверитьРавенство(ФиксированноеСоответствие.Количество(), Соответствие.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_СоздатьСоответствиеПоФиксированномуСоответствию() Экспорт

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Ключ1", "Значение1");
	
	ФиксированноеСоответствие = Новый ФиксированноеСоответствие(Соответствие);
	
	НовоеСоответствие = Новый Соответствие(ФиксированноеСоответствие);

	ПроверитьРавенство(ТипЗнч(НовоеСоответствие), Тип("Соответствие"));
	ПроверитьРавенство(ФиксированноеСоответствие.Количество(), НовоеСоответствие.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьНеизменностьфиксированногоСоответствия() Экспорт

	Значение = "Значение1";
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Ключ1", Значение);
	
	ФиксированноеСоответствие = Новый ФиксированноеСоответствие(Соответствие);
	
	ПроверитьРавенство(ФиксированноеСоответствие["Ключ1"], Соответствие["Ключ1"]);

	Соответствие["Ключ1"] = Значение+1;
	ПроверитьРавенство(ФиксированноеСоответствие["Ключ1"], Значение);

	Значение = "Значение10";
	ПроверитьРавенство(ФиксированноеСоответствие["Ключ1"], "Значение1");
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьОтсутствиеМетодаВставить() Экспорт

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Ключ1", "Значение1");
	
	ФиксированноеСоответствие = Новый ФиксированноеСоответствие(Соответствие);
	
	Попытка
		ФиксированноеСоответствие.Вставить("Ключ2", "Значение2");
	Исключение
		ПроверитьРавенство(ФиксированноеСоответствие.Количество(), 1);
		Возврат;
	КонецПопытки;

	ВызватьИсключение "У класса ""ФиксированноеСоответствие"" не должно быть метода ""Вставить"", а он есть";	
КонецПроцедуры


&НаКлиенте
Процедура ТестДолжен_ПроверитьЧтоНельзяПоменятьЗначениеПриОбращенииЧерезКлюч() Экспорт

	Значение = "Значение1";
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Ключ1", Значение);
	
	ФиксированноеСоответствие = Новый ФиксированноеСоответствие(Соответствие);
	
	Попытка
		ФиксированноеСоответствие["Ключ1"] = Значение+1;
	Исключение
		ПроверитьРавенство(ФиксированноеСоответствие["Ключ1"], Значение);
		Возврат;
	КонецПопытки;

	ВызватьИсключение "Ожидали, что у класса ""ФиксированноеСоответствие"" нельзя менять значение через обращение по ключу, а получили, что меняется";	
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьЧтоНесуществующийКлючНельзяПрочитать() Экспорт
	
	Значение = "Значение1";
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Ключ1", Значение);
	
	ФиксированноеСоответствие = Новый ФиксированноеСоответствие(Соответствие);
	
	Попытка
		А = ФиксированноеСоответствие["Ключ2"];
	Исключение
		Если Не ИнформацияОбОшибке().Описание = "Значение, соответствующее ключу, не задано" Тогда
			ВызватьИсключение;
		КонецЕсли;
		Возврат;
	КонецПопытки;
	
	ВызватьИсключение "Чтение несуществующего ключа было выполнено";
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьЧтоСуществующийКлючНельзяИзменить() Экспорт

	Значение = "Значение1";
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Ключ1", Значение);
	
	ФиксированноеСоответствие = Новый ФиксированноеСоответствие(Соответствие);
	
	Попытка
		ФиксированноеСоответствие["Ключ1"] = 5;
	Исключение
		ПроверитьРавенство(ФиксированноеСоответствие["Ключ1"], Значение);
		Если Не ИнформацияОбОшибке().Описание = "Индексированное значение доступно только для чтения" Тогда
			ВызватьИсключение;
		КонецЕсли;
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьЧтоПолучениеНесуществующегоКлючаНеВызываетОшибки() Экспорт

	Соответствие = Новый Соответствие;
	ФиксированноеСоответствие = Новый ФиксированноеСоответствие(Соответствие);
	
	Значение = ФиксированноеСоответствие.Получить("Заведомо отсутствующий ключ");
	ПроверитьРавенство(Значение, Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРавенство(Значение1, Значение2)
	НомерТеста = НомерТеста + 1;
	Если Значение1 = Значение2 Тогда
		Сообщить("" +НомерТеста + ") "+Значение1 + " = " + Значение2);
	Иначе
		Сообщить("" +НомерТеста + ") " +Значение1 + " <> " + Значение2);
	КонецЕсли;
КонецПроцедуры
