НомерТеста = 0;
ТестДолжен_СоздатьФиксированныйМассивПоМассиву();
ТестДолжен_СоздатьМассивПоФиксированномуМассиву();
ТестДолжен_ПроверитьНеизменностьФиксированногоМассива(); 
ТестДолжен_ПроверитьОтсутствиеНенужныхМетодов();

&НаКлиенте
Процедура ТестДолжен_СоздатьМассивПоФиксированномуМассиву() Экспорт

	Массив = Новый Массив;
	Количество = 10;
	
	Пока Количество > 0 Цикл
		Массив.Добавить(Количество);
		Количество = Количество - 1;
	КонецЦикла;
	
	ФиксированныйМассив = Новый ФиксированныйМассив(Массив);
	
	НовыйМассив = Новый Массив(ФиксированныйМассив);

	ПроверитьРавенство(ТипЗнч(НовыйМассив), Тип("Массив"));
	ПроверитьРавенство(НовыйМассив.Количество(), Массив.Количество());
	ПроверитьРавенство(НовыйМассив.ВГраница(), Массив.ВГраница());
	
	Для Инд = 0 По НовыйМассив.ВГраница() Цикл
		ПроверитьРавенство(НовыйМассив[Инд], Массив[Инд]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_СоздатьФиксированныйМассивПоМассиву() Экспорт

	Массив = Новый Массив;
	
	Количество = 10;
	
	Пока Количество > 0 Цикл
		Массив.Добавить(Количество);
		Количество = Количество - 1;
	КонецЦикла;
	
	ФиксированныйМассив = Новый ФиксированныйМассив(Массив);
	
	ПроверитьРавенство(ТипЗнч(ФиксированныйМассив), Тип("ФиксированныйМассив"));
	ПроверитьРавенство(ФиксированныйМассив.Количество(), Массив.Количество());
	ПроверитьРавенство(ФиксированныйМассив.ВГраница(), Массив.ВГраница());
	
	Для Инд = 0 По ФиксированныйМассив.ВГраница() Цикл
		ПроверитьРавенство(ФиксированныйМассив[Инд], Массив[Инд]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьНеизменностьФиксированногоМассива() Экспорт

	Массив = Новый Массив;
	
	Количество = 10;
	
	Пока Количество > 0 Цикл
		Массив.Добавить(Количество);
		Количество = Количество - 1;
	КонецЦикла;
	
	ФиксированныйМассив = Новый ФиксированныйМассив(Массив);
	
	Массив[0] = 0;
	ПроверитьРавенство(ФиксированныйМассив[0], 10);
	
	Массив.Очистить();
	ПроверитьРавенство(ФиксированныйМассив.Количество(), 10);
	
	Попытка
		ФиксированныйМассив[0] = 5;
	Исключение
		ПроверитьРавенство(ФиксированныйМассив[0], 10);
		Если Не ИнформацияОбОшибке().Описание = "Индексированное значение доступно только для чтения" Тогда
			ВызватьИсключение;
		КонецЕсли;
		Возврат;
	КонецПопытки;
	
	ВызватьИсключение "Значение в фиксированный массив было установлено";
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьОтсутствиеНенужныхМетодов() Экспорт

	ФиксированныйМассив = Новый ФиксированныйМассив(Новый Массив);
	
	Попытка
		
		ФиксированныйМассив.Добавить(0);
		Обнаружен = Истина;
		
	Исключение
		Обнаружен = Ложь;
	КонецПопытки;
	
	Если Обнаружен Тогда
		ВызватьИсключение "Обнаружен метод Добавить!";
	КонецЕсли;

	Попытка
		
		ФиксированныйМассив.Вставить(0, 0);
		Обнаружен = Истина;
		
	Исключение
		Обнаружен = Ложь;
	КонецПопытки;
	
	Если Обнаружен Тогда
		ВызватьИсключение "Обнаружен метод Вставить!";
	КонецЕсли;

	Попытка
		
		ФиксированныйМассив.Удалить(0);
		Обнаружен = Истина;
		
	Исключение
		Обнаружен = Ложь;
	КонецПопытки;

	Если Обнаружен Тогда
		ВызватьИсключение "Обнаружен метод Удалить!";
	КонецЕсли;
		
	Попытка
		
		ФиксированныйМассив.Очистить();
		Обнаружен = Истина;
		
	Исключение
		Обнаружен = Ложь;
	КонецПопытки;

	Если Обнаружен Тогда
		ВызватьИсключение "Обнаружен метод Очистить!";
	КонецЕсли;
		
КонецПроцедуры


&НаКлиенте
Процедура ПроверитьРавенство(Значение1, Значение2)
	НомерТеста = НомерТеста + 1;
	Если Значение1 = Значение2 Тогда
		Сообщить("" +НомерТеста + ") "+Значение1 + " = " + Значение2);
	Иначе
		Сообщить("" +НомерТеста + ") " +Значение1 + " <> " + Значение2);
	КонецЕсли;
КонецПроцедуры
