ТестДолжен_ВернутьСтроку1();
ТестДолжен_ВернутьСтроку2();
ТестДолжен_ВернутьСтроку5();
ТестДолжен_ВернутьСтроку10();

&НаКлиенте
Функция Инициализация()
	Данные = 
	"
	|Стр2
	|Стр3
	|Стр4
	|
	|Стр6
	|Стр7
	|Стр8
	|
	|Стр10";
	
	Возврат Данные;
КонецФункции

&НаКлиенте
Процедура ТестДолжен_ВернутьСтроку1() Экспорт
	Данные = Инициализация();

	Стр = СтрПолучитьСтроку(Данные, 1);

	//ПроверитьРавенство("", Стр);
	Сообщить("1: " + Стр);
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ВернутьСтроку2() Экспорт
	Данные = Инициализация();
	
	Стр = СтрПолучитьСтроку(Данные, 2);

	//ПроверитьРавенство("Стр2", Стр);
	Сообщить("2: " + Стр);
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ВернутьСтроку5() Экспорт
	Данные = Инициализация();
	
	Стр = СтрПолучитьСтроку(Данные, 5);

	//ПроверитьРавенство("", Стр);
	Сообщить("3: " + Стр);
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ВернутьСтроку10() Экспорт
	Данные = Инициализация();

	Стр = СтрПолучитьСтроку(Данные, 10);

	//ПроверитьРавенство("Стр10", Стр);
	Сообщить("4: " + Стр);
КонецПроцедуры
