ТестДолжен_СоздатьТаблицуЗначенийСИндексами();
ТестДолжен_ПроверитьСтроковоеПредставлениеИндекса();
ТестДолжен_ПроверитьПоискСИндексом();
ТестДолжен_ПоведениеИндексовПриУдаленииКолонок();
ТестДолжен_ПоведениеИндексовПриИзмененииЗначенийИндексированныхПолей();
ТестДолжен_ПоведениеИндексовПриИзмененииЗначенийИндексированныхПолейПоИндексу();
ТестДолжен_ПроверитьВыбросИсключений();
ТестДолжен_ПроверитьПоискПоИндексированнойКолонкеСЗаданнымТипом();


&НаСервереБезКонтекста
Процедура ТестДолжен_СоздатьТаблицуЗначенийСИндексами() Экспорт

	Т = Новый ТаблицаЗначений;
	Т.Колонки.Добавить("К1");
	Т.Колонки.Добавить("К2");
	Т.Колонки.Добавить("К3");

	И1 = Т.Индексы.Добавить("К1");
	И2 = Т.Индексы.Добавить("К1,К2");
	И3 = Т.Индексы.Добавить("К1,К2,К3");

	//ПроверитьРавенство(Т.Индексы.Количество(), 3);
	Сообщить(Т.Индексы.Количество());

	Т.Индексы.Удалить(Т.Индексы[0]);
	//ПроверитьРавенство(Т.Индексы.Количество(), 2);
	Сообщить(Т.Индексы.Количество());

	Т.Колонки.К1.Имя = "К_1";
	//ПроверитьРавенство(Т.Индексы[0][0], "К_1");
	Сообщить(Т.Индексы[0][0]);

	Для Каждого мИндекс Из Т.Индексы Цикл

		Для Каждого мИмяКолонки Из мИндекс Цикл

			Колонка = Т.Колонки.Найти(мИмяКолонки);
			//ПроверитьНеравенство(Колонка, Неопределено, "Не найдена колонка " + мИмяКолонки);
			Сообщить(Колонка.Имя);

		КонецЦикла;

	КонецЦикла;

	Т.Индексы.Очистить();
	//ПроверитьРавенство(Т.Индексы.Количество(), 0);
	Сообщить(Т.Индексы.Количество());

	ИндексСОдинаковымиПолями = Т.Индексы.Добавить("К2, К2, К2");
	//ПроверитьРавенство(ИндексСОдинаковымиПолями[0], "К2");
	Сообщить(ИндексСОдинаковымиПолями[0]);
	//ПроверитьРавенство(ИндексСОдинаковымиПолями[1], "К2");
	Сообщить(ИндексСОдинаковымиПолями[1]);
	//ПроверитьРавенство(ИндексСОдинаковымиПолями[2], "К2");
	Сообщить(ИндексСОдинаковымиПолями[2]);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестДолжен_ПроверитьСтроковоеПредставлениеИндекса() Экспорт

	Т = Новый ТаблицаЗначений;
	Т.Колонки.Добавить("К1");
	Т.Колонки.Добавить("К2");

	И1 = Т.Индексы.Добавить("К1");
	И2 = Т.Индексы.Добавить("К1,К2");
	И3 = Т.Индексы.Добавить("К1,К2,К2");
	И4 = Т.Индексы.Добавить("К2,К1,К2");

	//ПроверитьРавенство(Строка(И1), "К1");
	Сообщить(Строка(И1));
	//ПроверитьРавенство(Строка(И2), "К1, К2");
	Сообщить(Строка(И2));
	//ПроверитьРавенство(Строка(И3), "К1, К2, К2");
	Сообщить(Строка(И3));
	//ПроверитьРавенство(Строка(И4), "К2, К1, К2");
	Сообщить(Строка(И4));

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестДолжен_ПроверитьПоискСИндексом() Экспорт

	Т = Новый ТаблицаЗначений;
	Т.Колонки.Добавить("К1");
	Т.Колонки.Добавить("К2");
	Т.Индексы.Добавить("К1");
	Т.Индексы.Добавить("К2,К1");

	НекоеБольшоеЧисло = 1000; // не такое уж большое, чтобы тесты проходили быстрее
	Для Инд = 1 По НекоеБольшоеЧисло Цикл

		НоваяСтрока = Т.Добавить();
		НоваяСтрока.К1 = НекоеБольшоеЧисло;
		НоваяСтрока.К2 = Инд;
		НоваяСтрока.К1 = Инд;

	КонецЦикла;

	НайтиИПроверить(Т, НекоеБольшоеЧисло, "Поиск по индексированному полю");

	Т.Колонки.К1.Имя = "ДругоеИмя";
	НайтиИПроверить(Т, НекоеБольшоеЧисло, "Переименовали проиндексированную колонку");
	//ПроверитьРавенство(Т.Индексы[0][0], "ДругоеИмя");
	Сообщить(Т.Индексы[0][0]);

	Т.Колонки.ДругоеИмя.Имя = "К1";
	НайтиИПроверить(Т, НекоеБольшоеЧисло, "Вернули имя");

	Т.Свернуть("К2, К1");
	НайтиИПроверить(Т, НекоеБольшоеЧисло, "Свернули 0 раз");

	Т.Свернуть("К2", "К1");
	НайтиИПроверить(Т, НекоеБольшоеЧисло, "Свернули 1 раз");

	Т.Свернуть("К1", "К2");
	НайтиИПроверить(Т, НекоеБольшоеЧисло, "Свернули 2 раз");

	Т.Свернуть("К1");
	НайтиИПроверить(Т, НекоеБольшоеЧисло, "Свернули 3 раз");

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестДолжен_ПоведениеИндексовПриУдаленииКолонок() Экспорт

	Т = Новый ТаблицаЗначений;
	Т.Колонки.Добавить("К1");
	Т.Добавить().К1 = 1;
	Т.Добавить().К1 = 2;
	Т.Добавить().К1 = 3;

	Т.Индексы.Добавить("К1");
	//ПроверитьРавенство(Строка(Т.Индексы[0]), "К1");
	Сообщить(Строка(Т.Индексы[0]));

	Т.Колонки.Очистить();
	//ПроверитьРавенство(Строка(Т.Индексы[0]), ""); // Индекс не удаляется, состав полей пустой
	Сообщить(Строка(Т.Индексы[0]));

	Т.Колонки.Добавить("К1");
	Для i = 1 По 3 Цикл
		Т.Добавить();	
	КонецЦикла;

	Т[0].К1 = 3;
	Т[1].К1 = 2;
	Т[2].К1 = 1;

	СтруктураПоиска = Новый Структура("К1", 1);
	НайденныеСтроки = Т.НайтиСтроки(СтруктураПоиска);
	//ПроверитьРавенство(НайденныеСтроки.Количество(), 1);
	Сообщить(НайденныеСтроки.Количество());
	//ПроверитьРавенство(НайденныеСтроки[0], Т[2]);
	Сообщить(НайденныеСтроки[0]);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестДолжен_ПоведениеИндексовПриИзмененииЗначенийИндексированныхПолей() Экспорт

	Т = Новый ТаблицаЗначений;
	Т.Колонки.Добавить("К1");
	Т.Колонки.Добавить("К2");
	Т.Индексы.Добавить("К2");
	Т.Индексы.Добавить("К2, К1");
	Т.Индексы.Добавить("К1");
	Т.Добавить().К1 = 1;
	Т.Добавить().К1 = 2;
	Т.Добавить().К1 = 3;

	Т[0].К1 = 3;
	Т[1].К1 = 2;
	Т[2].К1 = 1;

	СтруктураПоиска = Новый Структура("К1", 1);
	НайденныеСтроки = Т.НайтиСтроки(СтруктураПоиска);
	//ПроверитьРавенство(НайденныеСтроки.Количество(), 1);
	Сообщить(НайденныеСтроки.Количество());
	//ПроверитьРавенство(НайденныеСтроки[0], Т[2]);
	Сообщить(НайденныеСтроки[0]);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестДолжен_ПоведениеИндексовПриИзмененииЗначенийИндексированныхПолейПоИндексу() Экспорт

	Т = Новый ТаблицаЗначений;
	Т.Колонки.Добавить("К1");
	Т.Колонки.Добавить("К2");
	Т.Индексы.Добавить("К2");
	Т.Индексы.Добавить("К2, К1");
	Т.Индексы.Добавить("К1");
	Т.Добавить().К1 = 1;
	Т.Добавить().К1 = 2;
	Т.Добавить().К1 = 3;

	Т[0]["К1"] = 3;
	Т[1]["К1"] = 2;
	Т[2]["К1"] = 1;

	СтруктураПоиска = Новый Структура("К1", 1);
	НайденныеСтроки = Т.НайтиСтроки(СтруктураПоиска);
	//ПроверитьРавенство(НайденныеСтроки.Количество(), 1);
	Сообщить(НайденныеСтроки.Количество());
	//ПроверитьРавенство(НайденныеСтроки[0], Т[2]);
	Сообщить(НайденныеСтроки[0].К1);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестДолжен_ПроверитьВыбросИсключений() Экспорт

	Т = Новый ТаблицаЗначений;
	Т.Колонки.Добавить("К1");
	Т.Колонки.Добавить("К2");
	Т.Индексы.Добавить("К2");
	Т.Индексы.Добавить("К2, К1");
	Т.Индексы.Добавить("К1");

	БылоИсключение = Ложь;
	Попытка
		Индекс = Т.Индексы[4];
	Исключение
		БылоИсключение = Истина;
	КонецПопытки;
	//ПроверитьИстину(БылоИсключение, "Доступ за пределы диапазона");
	Сообщить(БылоИсключение);
	
	БылоИсключение = Ложь;
	Попытка
		Индекс = Т.Индексы[-1];
	Исключение
		БылоИсключение = Истина;
	КонецПопытки;
	//ПроверитьИстину(БылоИсключение, "Доступ за пределы диапазона");
	Сообщить(БылоИсключение);

	Индекс = Т.Индексы[0];
	Т.Индексы.Удалить(Индекс);
	БылоИсключение = Ложь;
	Попытка
		Т.Индексы.Удалить(Индекс);
	Исключение
		БылоИсключение = Истина;
	КонецПопытки;
	//ПроверитьИстину(БылоИсключение, "Удаление несуществующего индекса");
	Сообщить(БылоИсключение);

	БылоИсключение = Ложь;
	Попытка
		Т.Индексы[0] = Индекс;
	Исключение
		БылоИсключение = Истина;
	КонецПопытки;
	//ПроверитьИстину(БылоИсключение, "Запись по индексу");
	Сообщить(БылоИсключение);

	БылоИсключение = Ложь;
	Попытка
		Т.Индексы.Добавить("НесуществующееПоле");
	Исключение
		БылоИсключение = Истина;
	КонецПопытки;
	//ПроверитьИстину(БылоИсключение, "Индекс по несуществующему полю");
	Сообщить(БылоИсключение);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура НайтиИПроверить(Знач Таблица, Знач ИскомоеЗначение, Знач Пояснение)

	// в проверяемом тесте индексированное поле всегда первое
	ИндексированноеПоле = Таблица.Колонки[0].Имя;

	Отбор = Новый Структура(ИндексированноеПоле, ИскомоеЗначение);
	ПоискПоИндексу = Таблица.НайтиСтроки(Отбор);

	//ПроверитьРавенство(ПоискПоИндексу.Количество(), 1, Пояснение);
	Сообщить(ПоискПоИндексу.Количество());
	//ПроверитьРавенство(ПоискПоИндексу[0][ИндексированноеПоле], ИскомоеЗначение, Пояснение);
	Сообщить(ПоискПоИндексу[0][ИндексированноеПоле]);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестДолжен_ПроверитьПоискПоИндексированнойКолонкеСЗаданнымТипом() Экспорт

	Т = Новый ТаблицаЗначений;
	Т.Колонки.Добавить("К1",Новый ОписаниеТипов("Строка"));
	Т.Индексы.Добавить("К1");
	
	Т.Добавить().К1 = "Стр1";
	Т.Добавить().К1 = "Стр2";
	Т.Добавить().К1 = "Стр3";


	СтруктураПоиска = Новый Структура("К1", "Стр2");
	НайденныеСтроки = Т.НайтиСтроки(СтруктураПоиска);
	//ПроверитьРавенство(НайденныеСтроки.Количество(), 1);
	Сообщить(НайденныеСтроки.Количество());
	//ПроверитьРавенство(НайденныеСтроки[0].К1, "Стр2");
	Сообщить(НайденныеСтроки[0].К1);

КонецПроцедуры
