&НаКлиенте
Процедура ТестДолжен_ПроверитьПоискВМассиве() Экспорт
    
    Массив = Новый Массив();
    Массив.Добавить("1");
    Массив.Добавить("2");
    Массив.Добавить("3");

    Если Массив.Найти("1") <> Неопределено Тогда
        НашлиЗначение1 = Истина;
    Иначе
        НашлиЗначение1 = Ложь;
    КонецЕсли;



    Если Массив.Найти("9") <> Неопределено Тогда
        НашлиЗначение9 = Истина;
    Иначе
        НашлиЗначение9 = Ложь;
    КонецЕсли;
    
    //ПроверитьРавенство(НашлиЗначение1, Истина, "Нашли 1");
	Сообщить(НашлиЗначение1);
    //ПроверитьРавенство(НашлиЗначение9, Ложь, "Не нашли 9");
	Сообщить(НашлиЗначение9);
    //ПроверитьРавенство(Массив.Найти("2"), 1, "Индекс элемента по значению");
	Сообщить(Массив.Найти("2"));
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_СоздатьМногомерныйМассив() Экспорт

	Массив = Новый Массив(2);
	Массив[0] = Новый Массив(4);
	Массив[1] = Новый Массив(4);	
	Массив[1][1] = Новый Массив(6);
	Массив[1][1][2] = Новый Массив(8);

	//Ожидаем.Что(Массив.Количество(), "1-я размерность").Равно(2);
	Сообщить(Массив.Количество());
	//Ожидаем.Что(Массив[0].Количество(), "2-я размерность").Равно(4);
	Сообщить(Массив[0].Количество());
	//Ожидаем.Что(Массив[1][1].Количество(), "3-я размерность").Равно(6);
	Сообщить(Массив[1][1].Количество(),);
	//Ожидаем.Что(Массив[1][1][2].Количество(), "4-я размерность").Равно(8);
	Сообщить(Массив[1][1][2].Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьЗаписьВМногомерныйМассив() Экспорт

	Массив = Новый Массив(3);
	Массив[0] = Новый Массив(2);
	Массив[0][0] = Новый Массив(2);
	Массив[1] = Новый Массив(2);
	Массив[1][0] = Новый Массив(2);
	Массив[1][1] = Новый Массив(2);
	Массив[2] = Новый Массив(10);
	Массив[2][0] = Новый Массив(2);
	Массив[2][1] = Новый Массив(2);
	Массив[2][9] = Новый Массив(2);



	Массив[0][0][0] = "Привет";
	Массив[1][0][0] = "Привет.";
	Массив[1][1][0] = "Привет!";
	Массив[2][0][0] = "Привет!!!";

	//Ожидаем.Что(Массив[0][0][0]).Равно("Привет");
	Сообщить(Массив[0][0][0]);
	//Ожидаем.Что(Массив[1][0][0]).Равно("Привет.");
	Сообщить(Массив[1][0][0]);
	//Ожидаем.Что(Массив[1][1][0]).Равно("Привет!");
	Сообщить(Массив[1][1][0]);
	//Ожидаем.Что(Массив[2][0][0]).Равно("Привет!!!");
	Сообщить(Массив[2][0][0]);
	//Ожидаем.Что(Массив[2][1][0]).Равно(Неопределено);
	Сообщить(Массив[2][1][0]);
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьОшибкуРазмерности() Экспорт

	Попытка
		Массив = Новый Массив(-1);
	Исключение
		Ошибка = ИнформацияОбОшибке().Описание;
		//ПроверитьНеРавенство(Найти(Ошибка,"Неверное значение аргумента номер 1"), 0, "Неверный вид ошибки: "+Ошибка);  // не "номер 3"!
		Сообщить(Ошибка);
		Возврат;
	КонецПопытки;
	
	ВызватьИсключение "Должно было быть выдано исключение, но его не было";

КонецПроцедуры


ТестДолжен_ПроверитьПоискВМассиве();
ТестДолжен_СоздатьМногомерныйМассив();
ТестДолжен_ПроверитьЗаписьВМногомерныйМассив(); 
ТестДолжен_ПроверитьОшибкуРазмерности();